<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f85b73c2ee3589a2ace49191dd041a976e3854ef1292b7cda7185f4f3a75f992","plan_job_ref":"Job Terraform Plan #14 at https://github.com/getsentry/security-cloud-functions-template/actions/runs/13275296323","plan_hash":"0328d3c2eba9ed542acc54dee10fa1f273cf92f44ec78015a9ce6fa38da7e4d1","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __.__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.functions.module.cloud_function_gen2["get-gh-app-token"].google_cloudfunctions2_function.function will be updated in-place
  ~ resource "google_cloudfunctions2_function" "function" {
        id               = "projects/jeffreyhung-test/locations/us-west1/functions/get-gh-app-token"
        name             = "get-gh-app-token"
        # (11 unchanged attributes hidden)

      ~ build_config {
            # (7 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "src-989adf691d3a45530f1902481ebe44c2.zip" -> "src-dfc0ff933c1092b4381fb05387439ead.zip"
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions.module.cloud_function_gen2["get-gh-app-token"].google_storage_bucket_object.zip must be replaced
-/+ resource "google_storage_bucket_object" "zip" {
      + content             = (sensitive value)
      ~ crc32c              = "QD14EQ==" -> (known after apply)
      ~ detect_md5hash      = "mJrfaR06RVMPGQJIHr5Ewg==" -> "different hash"
      - event_based_hold    = false -> null
      ~ generation          = 1738370805134689 -> (known after apply)
      ~ id                  = "********************************************************************************" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "mJrfaR06RVMPGQJIHr5Ewg==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-989adf691d3a45530f1902481ebe44c2.zip?generation=1738370805134689&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "src-989adf691d3a45530f1902481ebe44c2.zip" -> "src-dfc0ff933c1092b4381fb05387439ead.zip" # forces replacement
      ~ output_name         = "src-989adf691d3a45530f1902481ebe44c2.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-989adf691d3a45530f1902481ebe44c2.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform Apply #28](https://github.com/getsentry/security-cloud-functions-template/actions/runs/13275313747)